In [3]:
import pandas as pd

In [29]:
data = {'Name':['Tom', 'Jack', 'nick', 'juli', 'Jack', 'Jack'],
        'marks':[99, 98, 95, 90, 98, 90]}

In [30]:
df = pd.DataFrame( data)

In [10]:
df.sample()

   Name  marks
2  nick     95

In [31]:
df

   Name  marks
0   Tom     99
1  Jack     98
2  nick     95
3  juli     90
4  Jack     98
5  Jack     90

In [21]:
df.drop_duplicates(subset = ['Name'], inplace = True)

In [45]:
data = df.groupby('Name')

In [46]:
data.head()

   Name  marks
0   Tom     99
1  Jack     98
2  nick     95
3  juli     90
4  Jack     98
5  Jack     90

In [47]:
data.ngroups

4